"""



{
    "fields": {

        
    }
}







Новая структура:

"field_name": {
    "title": "Цена", # Краткое описание
    "description": "Текущая цена товара", # Подробное описание
    "description_examples": "", # Описание, какие значения обычно есть в этом поле
    "type": "number", # ? 

}


И запаковать в разделы, типо "Обязательные поля", "Дополнительные", и т.п.












Основные (обязательные):

"name": "Наименование товара",
"link": "Ссылка на товар",              ###########
"price": "Цена",
"oldprice": "Старая цена",
"stock": "Наличие товара",              ###########

Дополнительные, которые часто есть:

"imageLink": "Ссылка на фото товара",
"brand": "Бренд",
"article": "Артикул",
"product_id": "Код товара",
"manufacturer": "Производитель",
"color": "Цвет товара",

"barcode": "Штрихкод",
"category": "Категория",
"uom": "Единица измерения",
"series": "Серия",
"partNumber": "Партномер (артикул производителя)",
"breadCrumbs": "Поисковая цепочка",




"currency": "Валюта",
"region": "Регион",

"volume": "Объём товара",
"size": "Размер товара",
"length": "Длина",
"width": "Ширина",
"height": "Высота",
"diameter": "Диаметр",


"oem": "OEM-номер",
"ean": "Международный артикул",

"price_discount": "Акционная цена",
"card_price": "Цена по дисконтной карте",
"cashback": "Кешбек \ Бонусы",

"address": "Адрес магазина",
"shop": "Название магазина",

"seller_rating": "Рейтинг товара / Кол-во звездочек",

"availableCount": "Кол-во товара в наличии",
"ordersCount": "Количество заказов",
"rating": "Рейтинг товара / Кол-во звездочек",
"reviewsCount": "Количество отзывов",
"description": "Описание товара",

"promotionDate": "Дата окончания действия акции",

"material": "Материал",

"deliveryDays": "Срок доставки в днях",
"deliveryDate": "Дата доставки",
"equipment": "Комплектация и измерения/кол-во товаров",
"packaging": "Упаковка",


Поля для аптечных товаров:
"releaseForm": "Форма выпуска(мазь,пилюли)",
"dosage": "Дозировка лекарства",


Книжные поля:
"bookype": "Тип книги",
"isbn": "Международный стандартный книжный номер",
"coverType": "Тип обложки",
"publishYear": "Год выпуска",
"pages": "Количество страниц",
"publisher": "Издательство",
"author": "Автор",


"collection": "Коллекция товара",


"availibility": "Статус товара",
"weight": "Вес товара",
"kcal_100": "Пищевая ценность на 100 г",
"deliveryPrice": "Стоимость доставки",
"deliveryAddress": "Адрес доставки",
"model": "Модель",

"aromaName": "Аромат",
"count": "Кол-во товара в упаковке",
"users": "Кол-во пользователей",







Юридические данные:
"seller": "Продавец",
"shopLink": "Ссылка на магазин",
"sellerLink": "Ссылка на продавца",
"sellerName": "Юридическое название продавца",
"supplierName": "Юридическое название продавца",
"sellerINN": "ИНН продавца",
"sellerORGN": "ОГРН/ОГРНИП продавца",
"sellerAddress": "Адрес продавца",
"vat": "Признак включен ли НДС в указанную цену",




Для техники, оборудования с мотором и подобного:
"ram": "Объем оперативной памяти",
"rom": "Объем постоянной памяти",
"voltage": "Напряжение (В)",
"torque": "Максимальный крутящий момент (Н·м)",
"battery_capacity": "Емкость аккумулятора",
"speeds_count": "Количество скоростей",
"bullet_diameter": "Диаметр патрона",
"disk_diameter": "Диаметр диска (мм)",
"power": "Мощность",
"speed_regulation": "Регулировка скорости",
"constant_speed": "Поддержание постоянных оборотов под нагрузкой",
"revolutions": "Число оборотов",
"profile_number": "Номер профиля",
"steel_mark": "Марка стали",









Служебные (разобраться позже)

"timestamp": "Дата и время сбора данных",
"InStock_trigger": "Триггер наличия товара",
"OutOfStock_trigger": "Триггер отсутствия товара"
"allCharacteristics": "Все характеристики товара",










"""

all_fields = {
    
}