# Мои задачи на будущее, для блока создания агентов

"""

* ChatGPT сказал мне что стоит разделить память на facts, state и notes, но пкао что я сохраняю всё в одной общей области
* Если инструмент возвращает слишком большой ответ, то надо добавить обработчик, что бы он не сохранялся в history, и не передавался полностью далее для агента
* Помнить, что лимит шагов агента может быть исчерпан, без решения задачи - потом обработать это 
* Позже добавить инструмент - получить полную историю выполнения задания

Позже добавить в агента функционал:
* development_report добавить

"""
