# Мои задачи на будущее, для блока создания агентов

"""

* ChatGPT сказал мне что стоит разделить память на facts, state и notes, но пкао что я сохраняю всё в одной общей области
* Если инструмент возвращает слишком большой ответ, то надо добавить обработчик, что бы он не сохранялся в history, и не передавался полностью далее для агента
* Помнить, что лимит шагов агента может быть исчерпан, без решения задачи - потом обработать это 
* Позже добавить инструмент - получить полную историю выполнения задания
* Не проверил функционал напоминании о сохранении информации из выпадающих шагов истории

Позже добавить в агента функционал:
* development_report добавить


*   Добавить pip install tiktoken в reuarments

    Добавить рассчёт стоимости

    Ввод (input)	$1.75 / 1M токенов
    Кэшированный ввод	$0.175 / 1M токенов
    Вывод (output)	$14.00 / 1M токенов

    Добавить рассчёт кешированного ввода

    Примерный рассчёт - 4 рубля за решение этой задачи, без учёта кешированных токенов

"""
